In [13]:
import pandas as pd
import random

# Series

In [15]:
data = pd.Series([-5, 2, 7, 1])

In [16]:
data

0   -5
1    2
2    7
3    1
dtype: int64

In [17]:
type(data)

pandas.core.series.Series

In [18]:
data.shape

(4,)

In [19]:
data[0]

-5

In [20]:
data = pd.Series([-5, 2, 7, 1, 2], index = ['a','b','c','d','e'])

In [21]:
data

a   -5
b    2
c    7
d    1
e    2
dtype: int64

In [22]:
data['d']

1

In [23]:
pd.Series?

In [24]:
data.describe()

count    5.00000
mean     1.40000
std      4.27785
min     -5.00000
25%      1.00000
50%      2.00000
75%      2.00000
max      7.00000
dtype: float64

In [25]:
data.median()

2.0

In [26]:
data.duplicated()

a    False
b    False
c    False
d    False
e     True
dtype: bool

# DataFrame

In [31]:
df = pd.DataFrame({'pais':['Brasil', 'chile','Argentina', 'Bolivia'],'Jogos':[120, 135, 78, 115]})

In [32]:
df

        pais  Jogos
0     Brasil    120
1      chile    135
2  Argentina     78
3    Bolivia    115

In [33]:
df.shape

(4, 2)

In [34]:
df['pais']

0       Brasil
1        chile
2    Argentina
3      Bolivia
Name: pais, dtype: object

In [35]:
type(df['pais'])

pandas.core.series.Series

In [36]:
df['Jogos'].describe()

count      4.000000
mean     112.000000
std       24.207437
min       78.000000
25%      105.750000
50%      117.500000
75%      123.750000
max      135.000000
Name: Jogos, dtype: float64

In [37]:
df['pais'][2]

'Argentina'

In [39]:
pd.DataFrame?

# Importando arquivo dataset

In [40]:
data = pd.read_csv('dados.csv')

In [41]:
data

      condominio  quartos  suites  vagas  area    bairro    preco       pm2
0            350        1     0.0    1.0    21  Botafogo   340000  16190.48
1            800        1     0.0    1.0    64  Botafogo   770000  12031.25
2            674        1     0.0    1.0    61  Botafogo   600000   9836.07
3            700        1     1.0    1.0    70  Botafogo   700000  10000.00
4            440        1     0.0    1.0    44  Botafogo   515000  11704.55
...          ...      ...     ...    ...   ...       ...      ...       ...
1992        1080        3     1.0    1.0    80    Tijuca   680000   8500.00
1993         750        3     0.0    1.0    82    Tijuca   650000   7926.83
1994         700        3     1.0    1.0   100    Tijuca   629900   6299.00
1995        1850        3     1.0    2.0   166    Tijuca  1600000   9638.55
1996         800        3     1.0    1.0   107    Tijuca   540000   5046.73

[1997 rows x 8 columns]

In [42]:
data.shape

(1997, 8)

In [44]:
data.head(15)

    condominio  quartos  suites  vagas  area    bairro   preco       pm2
0          350        1     0.0    1.0    21  Botafogo  340000  16190.48
1          800        1     0.0    1.0    64  Botafogo  770000  12031.25
2          674        1     0.0    1.0    61  Botafogo  600000   9836.07
3          700        1     1.0    1.0    70  Botafogo  700000  10000.00
4          440        1     0.0    1.0    44  Botafogo  515000  11704.55
5          917        1     1.0    1.0    60  Botafogo  630000  10500.00
6          850        1     1.0    1.0    65  Botafogo  740000  11384.62
7          350        1     1.0    1.0    43  Botafogo  570000  13255.81
8          440        1     1.0    1.0    26  Botafogo  430000  16538.46
9          510        1     1.0    1.0    42  Botafogo  500000  11904.76
10         200        1     0.0    1.0    35  Botafogo  500000  14285.71
11         552        1     1.0    1.0    67  Botafogo  790000  11791.04
12         495        1     1.0    1.0    54  Botafogo  515000   9537.04
13         340        1     1.0    1.0    40  Botafogo  410000  10250.00
14         800        1     1.0    1.0    60  Botafogo  625000  10416.67

In [45]:
data.tail(15)

      condominio  quartos  suites  vagas  area  bairro    preco      pm2
1982        1100        3     1.0    1.0   110  Tijuca   750000  6818.18
1983         950        3     1.0    1.0   105  Tijuca   730000  6952.38
1984         970        3     1.0    1.0   110  Tijuca   650000  5909.09
1985        1336        3     2.0    1.0   120  Tijuca   850000  7083.33
1986         900        3     1.0    1.0    90  Tijuca   860000  9555.56
1987         880        3     1.0    1.0   100  Tijuca   800000  8000.00
1988         870        3     1.0    1.0   100  Tijuca   580000  5800.00
1989         400        3     1.0    1.0    92  Tijuca   480000  5217.39
1990         686        3     0.0    1.0   105  Tijuca   490000  4666.67
1991         450        3     1.0    1.0    72  Tijuca   435000  6041.67
1992        1080        3     1.0    1.0    80  Tijuca   680000  8500.00
1993         750        3     0.0    1.0    82  Tijuca   650000  7926.83
1994         700        3     1.0    1.0   100  Tijuca   629900  6299.00
1995        1850        3     1.0    2.0   166  Tijuca  1600000  9638.55
1996         800        3     1.0    1.0   107  Tijuca   540000  5046.73

In [46]:
data.dtypes

condominio      int64
quartos         int64
suites        float64
vagas         float64
area            int64
bairro         object
preco           int64
pm2           float64
dtype: object

In [47]:
data['preco'].describe()

count    1.997000e+03
mean     1.229410e+06
std      1.155809e+06
min      1.300000e+05
25%      5.600000e+05
50%      9.000000e+05
75%      1.550000e+06
max      1.360000e+07
Name: preco, dtype: float64

In [48]:
data['preco'].mean()

1229410.1467200802

In [49]:
data['condominio'].describe()

count    1997.000000
mean      971.087631
std       653.893691
min         1.000000
25%       550.000000
50%       800.000000
75%      1200.000000
max      7071.000000
Name: condominio, dtype: float64

In [50]:
data.describe()

,condominio,quartos,suites,vagas,area,preco,pm2
count,1997.000000,1997.000000,1997.000000,1997.000000,1997.000000,1.997000e+03,1997.00000
mean,971.087631,2.128693,1.039559,1.153230,90.051577,1.229410e+06,13256.74635
std,653.893691,0.793866,0.443091,0.453837,46.417486,1.155809e+06,6977.37614
min,1.000000,1.000000,0.000000,0.000000,19.000000,1.300000e+05,2600.00000
25%,550.000000,1.000000,1.000000,1.000000,60.000000,5.600000e+05,7894.74000
50%,800.000000,2.000000,1.000000,1.000000,80.000000,9.000000e+05,11904.76000
75%,1200.000000,3.000000,1.000000,1.000000,110.000000,1.550000e+06,17156.86000
max,7071.000000,3.000000,3.000000,4.000000,475.000000,1.360000e+07,76666.67000

In [51]:
data['vagas'].value_counts()

1.0    1645
2.0     292
0.0      38
3.0      14
4.0       8
Name: vagas, dtype: int64

In [67]:
data[0:10]

   condominio  quartos  suites  vagas  area    bairro   preco       pm2
0         350        1     0.0    1.0    21  Botafogo  340000  16190.48
1         800        1     0.0    1.0    64  Botafogo  770000  12031.25
2         674        1     0.0    1.0    61  Botafogo  600000   9836.07
3         700        1     1.0    1.0    70  Botafogo  700000  10000.00
4         440        1     0.0    1.0    44  Botafogo  515000  11704.55
5         917        1     1.0    1.0    60  Botafogo  630000  10500.00
6         850        1     1.0    1.0    65  Botafogo  740000  11384.62
7         350        1     1.0    1.0    43  Botafogo  570000  13255.81
8         440        1     1.0    1.0    26  Botafogo  430000  16538.46
9         510        1     1.0    1.0    42  Botafogo  500000  11904.76

In [68]:
data[513:518]['vagas']

513    1.0
514    1.0
515    1.0
516    1.0
517    2.0
Name: vagas, dtype: float64

In [72]:
data[1990::2]['vagas']

1990    1.0
1992    1.0
1994    1.0
1996    1.0
Name: vagas, dtype: float64

In [73]:
data.loc[7:15,['condominio']]

    condominio
7          350
8          440
9          510
10         200
11         552
12         495
13         340
14         800
15         530

In [74]:
data.loc[7:15,['condominio','preco']]

    condominio   preco
7          350  570000
8          440  430000
9          510  500000
10         200  500000
11         552  790000
12         495  515000
13         340  410000
14         800  625000
15         530  360000

In [76]:
data.loc[[2,4,8,15],:]

    condominio  quartos  suites  vagas  area    bairro   preco       pm2
2          674        1     0.0    1.0    61  Botafogo  600000   9836.07
4          440        1     0.0    1.0    44  Botafogo  515000  11704.55
8          440        1     1.0    1.0    26  Botafogo  430000  16538.46
15         530        1     0.0    1.0    40  Botafogo  360000   9000.00

In [78]:
data.loc[(data['preco']) > 600000]

      condominio  quartos  suites  vagas  area    bairro    preco       pm2
1            800        1     0.0    1.0    64  Botafogo   770000  12031.25
3            700        1     1.0    1.0    70  Botafogo   700000  10000.00
5            917        1     1.0    1.0    60  Botafogo   630000  10500.00
6            850        1     1.0    1.0    65  Botafogo   740000  11384.62
11           552        1     1.0    1.0    67  Botafogo   790000  11791.04
...          ...      ...     ...    ...   ...       ...      ...       ...
1987         880        3     1.0    1.0   100    Tijuca   800000   8000.00
1992        1080        3     1.0    1.0    80    Tijuca   680000   8500.00
1993         750        3     0.0    1.0    82    Tijuca   650000   7926.83
1994         700        3     1.0    1.0   100    Tijuca   629900   6299.00
1995        1850        3     1.0    2.0   166    Tijuca  1600000   9638.55

[1411 rows x 8 columns]

In [83]:
data.loc[(data['vagas'] >= 4)]['bairro'].value_counts()

Copacabana    3
Ipanema       3
Leblon        2
Name: bairro, dtype: int64

In [84]:
data.iloc[:10,0]

0    350
1    800
2    674
3    700
4    440
5    917
6    850
7    350
8    440
9    510
Name: condominio, dtype: int64

In [85]:
data.iloc[[2,4,5,15],1]

2     1
4     1
5     1
15    1
Name: quartos, dtype: int64

In [86]:
data.iloc[:,[2,4,7]]

      suites  area       pm2
0        0.0    21  16190.48
1        0.0    64  12031.25
2        0.0    61   9836.07
3        1.0    70  10000.00
4        0.0    44  11704.55
...      ...   ...       ...
1992     1.0    80   8500.00
1993     0.0    82   7926.83
1994     1.0   100   6299.00
1995     1.0   166   9638.55
1996     1.0   107   5046.73

[1997 rows x 3 columns]

In [87]:
data.iloc[:,[2,4,7]].columns

Index(['suites', 'area', 'pm2'], dtype='object')

In [92]:
mat1 = pd.DataFrame([random.randint(0,10) for i in range(0,3)])

In [94]:
mat1

    0
0   4
1   8
2  10

In [95]:
mat2 = pd.DataFrame([random.randint(0,10) for i in range(0,3)])

In [96]:
mat2

   0
0  8
1  2
2  4

In [97]:
mat1.shape

(3, 1)

In [98]:
mat1.T

   0  1   2
0  4  8  10

In [99]:
mat1

    0
0   4
1   8
2  10

In [101]:
mat1.dot(mat2.T)

    0   1   2
0  32   8  16
1  64  16  32
2  80  20  40

In [103]:
pd.DataFrame.dot(mat1.T, mat2)

    0
0  88